
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.ec2.tls_private_key.main: Refreshing state... [id=74a08dccb4216efd12938f9bbb3922b28bd4f9a4]
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.git.github_branch_protection.devops_challenge: Refreshing state... [id=BPR_kwDONzQI9c4DiCKo]
module.git.github_actions_secret.devops_challenge_aws_access_key_id: Refreshing state... [id=devops-challenge-teamsoft:AWS_ACCESS_KEY_ID]
module.git.github_actions_secret.devops_challenge_aws_secret_access_key: Refreshing state... [id=devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY]
module.git.github_actions_secret.devops_challenge_git_auth_token: Refreshing state... [id=devops-challenge-teamsoft:GIT_AUTH_TOKEN]
module.git.github_actions_secret.devops_challenge_runner_github_token: Refreshing state... [id=devops-challenge-teamsoft:RUNNER_GITHUB_TOKEN]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.s3.aws_s3_bucket.server_ssh_keys_bucket: Refreshing state... [id=devops-challenge-teamsoft-ssh-keys-bucket]
module.ec2.aws_s3_object.ssh_private_key: Refreshing state... [id=ssh-keys/server-key.pem]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ec2.aws_s3_object.ssh_private_key has changed
  ~ resource "aws_s3_object" "ssh_private_key" {
        id                            = "ssh-keys/server-key.pem"
      + metadata                      = {}
      + tags                          = {}
        # (25 unchanged attributes hidden)
    }

  # module.git.github_branch_protection.devops_challenge has changed
  ~ resource "github_branch_protection" "devops_challenge" {
        id                              = "BPR_kwDONzQI9c4DiCKo"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }
    }

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ etag                        = "W/\"efdc7fcd23180f56d017a401cdd2474e891141a2b8ca61f280cc234fb31b089f\"" -> "W/\"e5dbec69ba51cd5f9592071668a1b4c23c18d638ddcfc55d9619bc3e693996d0\""
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2.aws_instance.server will be created
  + resource "aws_instance" "server" {
      + ami                                  = "ami-0e1bed4f06a3b463d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "server-key-ec2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (sensitive)
      + tags                                 = {
          + "Managedby" = "Terraform"
          + "Name"      = "server-ec2"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all                             = {
          + "Managedby" = "Terraform"
          + "Name"      = "server-ec2"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d7023910c5473e0fad01a902a23238417c6bdf4e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (sensitive)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2.aws_key_pair.main will be created
  + resource "aws_key_pair" "main" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "server-key-ec2"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDFAepgZHTuMujdYMTzNv8Yq7EoBFvpcoccl/bltYzMNEOrQDhJmvfJhylm2x0nxi/6mRNP9y3tV3kVmQLbPg0nfMq4oS1fBIhu0EUqWv1UcIpLijovCoyP1GKIYzFhAoC/u1x9N2Zct7QCDwVdo8pslZQEOVT7o+JUr+L1K1awaWHWJMNbSPKUkVtsxiglHJ04MCXjv3331z0/QjFeZIZa3rYwI3bGpFsM+gzLSEFpVYYIQqtIvL1cUxLaWC5tjNeQzE2izXHmbdGeUhW+02z9TXBKwnR59m0WD0pFuxcMEuQNKtdfag/dK+gId4SXUp416lXytnas/0DXKpqGn5sAHpHaFzChCwwcgIY/syHjlR+zjteE1KUgR5l0SejAJ0OW/8juerG6jBTYnEAy+y8rerGGPPzuZgoGlLQA4ppmeBGMrfpAtBORcLV9nLbmr6d9MnzTyji/bFMaS8PTh8EohK5FJluFpJ8cqZnTNca/Y9kkF8C3Qr+96YdRgKafXfEYgwavN9oV/2G/TUNmb3RadpScSKgc2CS0OGsT9ePwtz/y3qd+PHBUzcL64zJKhl+blmywwW/S/WuAxrPk2o4NDH8QkRbNTDDnfUXkkbv4/SSVXCY1QNtj5Igj7jIGriJe9sc+vgAZ84TlZH7de7SNXrljb102Y659Sioz20QvUw=="
      + tags            = {
          + "Managedby" = "Terraform"
          + "Name"      = "server-key-ec2"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all        = {
          + "Managedby" = "Terraform"
          + "Name"      = "server-key-ec2"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
    }

  # module.ec2.aws_s3_object.ssh_private_key must be replaced
-/+ resource "aws_s3_object" "ssh_private_key" {
      ~ arn                           = "arn:aws:s3:::devops-challenge-teamsoft-ssh-keys-bucket/ssh-keys/server-key.pem" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      - cache_control                 = "" -> null
      ~ checksum_crc32                = "" -> (known after apply)
      ~ checksum_crc32c               = "" -> (known after apply)
      ~ checksum_sha1                 = "" -> (known after apply)
      ~ checksum_sha256               = "" -> (known after apply)
      - content_disposition           = "" -> null
      - content_encoding              = "" -> null
      - content_language              = "" -> null
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "63629e5eba745b1d3e226359fef50f6c" -> (known after apply)
      ~ id                            = "ssh-keys/server-key.pem" -> (known after apply)
      ~ key                           = "ssh-keys/server-key.pem" -> "ssh-keys/server-key-ec2.pem" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      - object_lock_legal_hold_status = "" -> null
      - object_lock_mode              = "" -> null
      - object_lock_retain_until_date = "" -> null
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      ~ version_id                    = "" -> (known after apply)
      - website_redirect              = "" -> null
        # (5 unchanged attributes hidden)
    }

  # module.git.github_branch_protection.devops_challenge will be updated in-place
  ~ resource "github_branch_protection" "devops_challenge" {
        id                              = "BPR_kwDONzQI9c4DiCKo"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ required_approving_review_count = 1 -> 0
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform Plan*